# Génie Logiciel
## TD1 - Bases de données et bases de données relationnelles

Une base de données est un ensemble d'informations qui est organisé de manière à être facilement accessible, géré et mis à jour. Elle est utilisée par les organisations comme méthode de stockage, de gestion et de récupération de l’informations.

Une base de données est stockée sous la forme d'un fichier ou d'un ensemble de fichiers sur un disque ou un disque magnétique, un disque optique ou tout autre support de stockage. L'information contenue dans ces fichiers peut être divisée en enregistrements. Ces enregistrements sont constitués d'un ou de plusieurs champs. Un champ constitue une seule pièce d’information, et chaque champ contient généralement des informations se rapportant à un aspect ou attribut de l'entité décrite par la base de données.

## Types de bases de données

Il existe plusieurs types de bases de données, chacune organisant les données sur le disque d'une manière différente. On peut notamment citer:
* **Relationnelles :** les données sont groupées en tableaux (comme des fichiers CSV our Excel). Des relations sont créées entre les différents éléments des tableaux. Elles sont particulièrement adaptées lorsque les ensembles de données sont connectés entre eux. Apparu dans les années 80, elles se sont depuis imposées comme le modèle dominant parmis les autres types. SQL en est le principal représentant.
* **Non-Relationnelles :** les données sont représentées sous forme de document (souvent sous la forme de dictionnaires ou documents au format JSON). Ces bases sont particulièrement adaptées aux données semi-structurées ou non-structurées. En raison de leur fonctionnement à l'opposé des bases de données relationnelles et de SQL, ces bases sont dites **No-SQL**
* **Orientée graphe :** représente les données sous forme de graphe, c'est-à-dire de réseau. Les bases de connaissances et ontologies peuvent être considérés comme des bases de données orientées graphe.

Il n'y a pas de type de base de données supérieur à un autre. Chaque type doit être choisi en fonction du type de données que l'on souhaite stocker.

**Autre types de bases :** https://en.wikipedia.org/wiki/Database#Classification

## Bases de données relationnelles

Une base de données relationnelle est un type de base de données où les données sont liées à d'autres informations au sein des bases de données. Les bases de données relationnelles sont composées d’un ensemble de tables qui peuvent être accessibles et reconstruites de différentes manières, sans qu'il soit nécessaire de réarranger ces tables de quelque façon que ce soit. Le langage de requête structuré (SQL) est l’interface standard pour une base de données relationnelle. Les instructions SQL sont utilisées à la fois pour interroger de façon interactive les données contenues dans la base de données relationnelle et pour collecter les données dans le cadre de rapports.

Les données sont organisées en lignes, colonnes et tableaux et sont indexées pour faciliter la recherche d'informations. Les données sont mises à jour, complétées ou encore supprimées au fur et à mesure que de nouvelles informations sont ajoutées. Elles contiennent par exemple des agrégations d'enregistrements ou de fichiers de données, tels que les transactions de vente, les catalogues et inventaires de produits et les profils de clients.

Les enregistrements sont également organisés en tableaux qui contiennent des informations sur les relations entre les différents champs. À l'aide de mots-clés et de diverses commandes de tri, les utilisateurs peuvent rapidement rechercher, réorganiser, regrouper et sélectionner les champs dans de nombreux enregistrements pour récupérer ou créer des rapports sur des agrégats particuliers de données.

**Source :** https://www.oracle.com/fr/database/definition-base-de-donnees.html

### Le fonctionnement des bases de données relationnelles

Les systèmes de gestion de base de données relationnelle permettent de mettre en avant les relations entre les données. Ces données sont organisées en table dans des lignes et colonnes afin d’être accessibles. Chaque ligne est un produit ou une personne spécifique et les colonnes énumèrent les attributs qui se rapportent à ce produit ou à cette personne, tels que la couleur, la taille, etc.

SQL est un langage de programmation qui vous permet décrire, alimenter,interroger et gérer une base de données.

## Clés primaires et clés étrangères

Chaque élément (ligne) d'une table doit être unique et doit posséder un identifiant appelé **clé primaire** (primary key). Une clé primaire a les propriété suivantes : elle doit être unique, et ne peut être nulle. Afin que les requêtes utilisateurs soient exécutées rapidement, tous les éléments sont indexés par la base de données selon les clés primaires. 


Dans les tableaux ci-dessous, les colonnes **customerId** et **orderId** sont les clés primaires de chaque tableau respectif. 

**Table Clients**
<table>
<thead>
  <tr>
    <th>customerId<br></th>
    <th>Lastname</th>
    <th>Firstname</th>
    <th>orderId</th>
  </tr>
</thead>
<tbody>
  <tr>
    <td>1</td>
    <td>Gutehrle</td>
    <td>Nicolas</td>
    <td>2</td>
  </tr>
  <tr>
    <td>2</td>
    <td>Ozturk</td>
    <td>Yagmur</td>
    <td>4</td>
  </tr>
  <tr>
    <td>3<br></td>
    <td>Nomblot<br></td>
    <td>Aurelie</td>
    <td>3</td>
  </tr>
</tbody>
</table>

**Table Commandes**
<table>
<thead>
  <tr>
    <th>orderId</th>
    <th>Name</th>
  </tr>
</thead>
<tbody>
  <tr>
    <td>1</td>
    <td>steak</td>
  </tr>
  <tr>
    <td>2</td>
    <td>tofu</td>
  </tr>
  <tr>
    <td>3</td>
    <td>cafe</td>
  </tr>
  <tr>
    <td>4</td>
    <td>glace</td>
  </tr>
</tbody>
</table>

Les éléments d'un tableau peuvent faire référence / indiquer des éléments contenus dans d'autres tables en employant leur clé primaire. Dans ce cas, on parle de **clés étrangères** (foreign key). Dans les tableaux ci-dessus, la colonne **orderId** de la table 1 est une clé étrangère faisant référence à la colonne **orderId** de la table 2, qui est sa clé primaire. 

### Notes importantes sur les clés primaires

Les clés primaires doivent être simples. Ainsi, elles sont le plus souvent numériques. De plus, puisqu'elles servent à faire références aux éléments, il est important de ne pas modifier la clé primaire d'un élément, au risque de ne plus avoir les bonnes références.

### Système de Gestion de Base de Données

Un système de gestion de base de données (SGBD) est le logiciel qui permet à un ordinateur de stocker, récupérer, ajouter, supprimer et modifier des données. Un SGBD gère tous les aspects primaires d'une base de données, y compris la gestion de la manipulation des données, comme l'authentification des utilisateurs, ainsi que l'insertion ou l'extraction des données. Un SGBD définit ce qu'on appelle le schéma de données ou la structure dans laquelle les données sont stockées.

Objectifs d'un Système de Gestion de Base de Données : 

<ul>
    <li>Décrire les données indépendamment des applications</li>
    <li>Manipulation des données (interrogation et mise a jour</li>
    <li>Contrôler les données (intégrité et condentialité)</li>
    <li>Partage des données (contrôle des accès concurrents)</li>
    <li>Sécurité (reprise après panne, sauvegardes, etc.) ;</li>
    <li>Accès rapide (indexes, arbres balancés, ...)</li>
    <li>Indépendance physique (Pouvoir modier le stockage (disques) sans que cela ait de
répercussion au niveau des applications)</li>
    <li>Indépendance logique (Permettre aux di
érentes applications d’avoir des vues différentes
des mêmes données)</li>
   
</ul> 

**Source :** https://www.oracle.com/fr/database/systeme-gestion-base-de-donnees-sgbd-definition.html

## Installation de MySQL et MySQL Workbench

MySQL est un système de gestion de base de données relationnelle open source  basé sur le langage de requête structuré (SQL)

### MySQL

Téléchargement de l'installateur : https://dev.mysql.com/downloads/mysql/

**Windows :** https://dev.mysql.com/doc/refman/8.0/en/windows-installation.html
**macOS :** https://dev.mysql.com/doc/refman/8.0/en/macos-installation.html
**Linux :** https://dev.mysql.com/doc/refman/8.0/en/linux-installation.html

### MySQL Workbench et/ou WampServer

**MySQL Workbench :** https://www.mysql.com/fr/products/workbench/

**WampServer :** https://www.wampserver.com/ (pour Windows, si souci avec MySQL Workbench)

## Types de données

Les cinq grande familles de types de variable dans MySQL sont : 
* numeric
* string
* date & time
* spatial 
* JSON

Pour chaque famille de variable, il peut exister plusieurs types, dont certains semblent similaires. Ces types là diffèrent principalement dans la manière dont ils stockent l'information.

Certaines type, comme CHAR ou VARCHAR, demandent une taille maximale afin de faciliter la gestion de la mémoire. Ces champs ne pourront donc pas contenir de données supérieure à la taille indiquée. Ainsi, il est recommandé d'employer ces types uniquement lorsqu'on est sûr que la variable ne peut dépasser la taille indiquée.

**Documentation :** https://dev.mysql.com/doc/refman/8.0/en/data-types.html

Si votre champ est textuel, priviligiez VARCHAR(255) si ce champ ne doit contenir des petites valeurs textuelles (nom, prenom...). S'il doit contenir du texte plus important ou dont vous ne pouvez être sûr de la taille, priviligiez TEXT. 

Pour les champs numériques, priviligiez INT pour les valeurs entières et FLOAT pour valeurs à décimales.

<h2>Expressions en SQL</h2>
<h3>Création, suppréssion et modification de la structure des tables </h3>
<ul>
    <li>CREATE TABLE</li>
    <li>ALTER TABLE</li>
    <li>DROP TABLE</li>
</ul>
<h3>Insertion, mise à jour et suppréssion d’enregistrements</h3>
<ul>
    <li>INSERT</li>
    <li>UPDATE</li>
    <li>DELETE</li>
</ul>

## Créer une base de données

Dans MySQL, une base de données s'appelle **schema**. Un serveur MySQL peut contenir plusieurs schemas. 

**Créer le schema**

CREATE SCHEMA `new_schema` ;

**Sélection de la base sur laquelle on travaille** 

USE `new_schema`;

**Dans MySQLWorkbench**

Cliquez sur "Créer une nouvelle base" en haut à gauche de l'interface.  Nommez là, et laissez les deux autres champs par défaut concernant l'encodage.

Une fois créée, double-cliquez sur l'icône de cette nouvelle base à gauche de l'interface pour l'utiliser.

### Exercice

Créez une base de données "CentreTesniere" depuis MySQL Workbench. Cette nouvelle base devrait apparaître dans le menu à gauche de l'interface une fois l'opération réalisée.

### Solution 

CREATE SCHEMA `CentreTesniere` ;

## Créer des tables dans la base

**Créer la table**

CREATE TABLE "nom_table" (colonnes de la table avec leur propriétés);

**Dans MySQL Workbench**

Dans votre base, cliquez-droit sur Table, puis "Nouvelle Table"

Par défaut, en double-cliquant dans le premier champ, l'interface en fera une clé primaire. Notez que les cases PK (Primary Key) et NN (Non Null) sont cochées.

N'oubliez pas de cocher AI (Auto Increment). Cela permettrea d'automatiquement ajouter la valeur de clé primaire à chaque ajout.

### Exercice

Créez une table Enseignants avec les colonnes et contraintes suivantes :
* idEnseignant : de type INT, doit être clé primaire, non nulle et s'auto-incrémenter
* nom : de type VARCHAR(45)
* prenom : de type VARCHAR(45)
* age : de type INT
* ville : de type VARCHAR(45)
* codePostal : de type INT
* dateNaissance : de type DATE

Vous pouvez indiquer le nom de la table dans le champ en haut de l'interface. Pour créer la table, cliquez sur "Appliquer".

### Solution 

CREATE TABLE `CentreTesniere`.`Enseignants` (
  `idEnseignant` INT NOT NULL AUTO_INCREMENT,
  `nom` VARCHAR(45) NULL,
  `prenom` VARCHAR(45) NULL,
  `age` INT NULL,
  `ville` VARCHAR(45) NULL,
  `codePostal` INT NULL,
  `dateNaissance` DATE NULL,
  PRIMARY KEY (`idEnseignant`));

## Intégrer des données

INSERT INTO "schema"."table" (liste des colonnes dans lesquelles insérer des données) VALUES (valeurs à insérer pour chaque colonne)

Exemple : INSERT INTO CentreTesniere.Enseignants (nom, prenom, age, ville, codePostal, dateNaissance)
VALUES ()

Vous pouvez insérer plusieurs valeurs avec une seule commande INSERT :

INSERT INTO ...
VALUES (...),
(...),
(...)

**Dans MySQL Workbench**

Faites Ctrl-T ou Command-T (pour mac) pour ouvrir un nouvel onglet Requête (il devrait déjà y en avoir un d'ouvert). C'est dans cet onglet que l'on peut écrire et exécuter des requêtes SQL. Pour les exécuter, cliquez sur le symbole en forme d'éclair en haut du champ de requête.

Pensez bien à terminer chaque requête par ";" afin de les séparer

### Exercice

Dans la table Enseignants, insérer les éléments suivants (chaque valeur correspond à une colonne de la table) : 
* "Gutehrle", "Nicolas", 28, "Dijon", 21000, "1995-02-17"
* "Guedat", "Nathan", 29, "Besancon", 25000, "1994-09-14"
* "Ozturk", "Yagmur", 26, "Besancon", 25000, "1997-03-19"
* "Nomblot", "Aurelie", 25, "Besancon", 25000, "1998-03-19"

Cliquez-droit ensuite sur votre table Etudiant dans l'interface à gauche, puis sur "Sélectionner des lignes" pour voir les premières lignes de votre table. Elle devrait contenir trois lignes.

### Solution

INSERT INTO CentreTesniere.Enseignants (nom, prenom, age, ville, codePostal, dateNaissance)
VALUES ("Gutehrle", "Nicolas", 28, "Dijon", 21000, 1995-02-17);

### Exercice

Dans la table Enseignants, insérer les éléments suivants (chaque valeur correspond à une colonne de la table) : 
* "Guedat", "Nathan", 29, "Besancon", 25000, "1994-09-14"
* "Ozturk", "Yagmur", 26, "Besancon", 25000, "1997-03-19"
* "Nomblot", "Aurelie", 25, "Besancon", 25000, "1998-03-19"

Cliquez-droit ensuite sur votre table Etudiant dans l'interface à gauche, puis sur "Sélectionner des lignes" pour voir les premières lignes de votre table. Elle devrait contenir trois lignes.

### Solution

INSERT INTO CentreTesniere.Enseignants (nom, prenom, age, ville, codePostal, dateNaissance)
VALUES ("Guedat", "Nathan", 29, "Besancon", 25000, "1994-09-14"),
("Ozturk", "Yagmur", 26, "Besancon", 25000, "1997-03-19"),
("Nomblot", "Aurelie", 25, "Besancon", 25000, "1998-03-19");

## Sélectionner des données

Pour sélectionner des données dans une table, on emploie la commande suivante : 

SELECT "nom des colonnes à sélectionner" FROM "nom de la table dans laquelle chercher les données"

Exemples : 
* SELECT nom FROM Enseignants 
* SELECT nom, prenom, age FROM Enseignants
* SELECT * FROM Enseignants (pour tout sélectionner)

### Exercice

Effectuez des requêtes pour obtenir les données suivantes :
* les dates de naissances
* le nom et la ville 
* la ville, le code postal et l'âge

### Solution

* SELECT dateNaissance FROM CentreTesniere.Enseignants;
* SELECT nom, ville FROM CentreTesniere.Enseignants;
* SELECT ville, codePostal, age FROM CentreTesniere.Enseignants;

## Affiner la sélection

La commande SELECT possède plusieurs arguments optionnels permettant d'affiner la recherche et de changer la présentation des résultats. Ces commandes sont : 

* WHERE : indique un critère de sélection des données. Plusieurs critères peuvent être entrés à l'aide du mot clé AND (SELECT xxx FROM yyy WHERE condition1 AND condition2)

* GROUP BY : groupe les lignes retournées ayant des valeurs identiques

* ORDER BY : change l'ordre d'affichage des résultat en fonction des colonnes choisies (SELECT xxx FROM yyy ORDER BY www). On peut indiquer plusieurs colonnes de tri. Par défaut, les valeurs sont triées par ordre ascent (ASC). Pour changer l'ordre de tri, on ajoute soit DESC soit ASC en fin de commande (SELECT xxx FROM yyy ORDER BY www ASC)

* LIMIT : limite le nombre de résultats obtenus

<b>Critères de sélection</b> : <br>
<ul>
<li>Comparaison : <, >, >=, <=, =, <>;</li>
<li>Opérateurs logiques : AND, OR, NOT;</li>
<li>Prédicats servant à définir des ensembles : IN, BETWEEN, AND et LIKE;</li>
<li>Comparaison avec la valeur NULL : IS NULL, IS NOT NULL.</li>
</ul>

### Exercice

* Sélectionner toutes les personnes dont ville est "Besancon". Faites en sorte que seuls les champs "nom", "prenom" et "ville" s'affichent
* Sélectionner toutes les personnes dont l'âge est strictement supérieur à 26. Faites en sorte que seuls les champs "nom", "prenom" et "age s'affichent
* Sélectionner toutes les personnes dont la ville est "Besancon" et l'âge est supérieur à 26, en affichant toutes les colonnes
* Sélectionner toutes les personnes dont la ville est "Besancon" et limiter le nombre de résultats à 1
* Grouper les valeurs selon les villes, en affichant seulement les villes
* Sélectionner toutes les données, en les triant selon le champ "dateNaissance" et par ordre descendant

### Solution 

* SELECT nom, prenom, age FROM CentreTesniere.Enseignants WHERE ville = "Besancon";
* SELECT nom, prenom, age FROM CentreTesniere.Enseignants WHERE age > 26;
* SELECT * FROM CentreTesniere.Enseignants WHERE ville = "Besancon" LIMIT 1;
* SELECT ville FROM CentreTesniere.Enseignants GROUP BY ville;
* SELECT * FROM CentreTesniere.Enseignants ORDER BY dateNaissance DESC;

## Fonctions grégaires

SQL comprend plusieurs fonctions pour manipuler et grouper les données d'une colonne. Les principales sont :
* COUNT : compter le nombre d'occurrence 
* SUM : fait la somme
* AVG : fait la moyenne
* MAX : retourne la valeur maximale
* MIN : retourne la valeur minimale
* HAVING : identique à WHERE, on l'emploie lorsque l'on utilise des fonction grégaires (ex: COUNT, SUM, ...), pour lesquelles WHERE ne fonctionne pas

Ces fonctions sont appelées après le mot clé SELECT (SELECT MAX(age) FROM Enseignants)

### Exercice

* Retourner la moyenne de la colonne "age"
* Retourner la valeur minimale de "dateNaissance"
* Compter le nombre d'occurrence de "Besancon" dans la colonne "ville" en affichant la ville et sa fréquence
* Afficher les villes pour lesquels la fréquence est supérieure ou égale à 2

### Solution

* SELECT AVG(age) FROM CentreTesniere.Enseignants;
* SELECT MIN(dateNaissance) FROM CentreTesniere.Enseignants;
* SELECT COUNT(ville), ville FROM CentreTesniere.Enseignants GROUP BY ville;
* SELECT COUNT(ville), ville FROM CentreTesniere.Enseignants GROUP BY ville HAVING COUNT(ville) >= 2;

## Modifier la table

Pour modifier le contenu de la table, on emploie la commande UPDATE :

UPDATE "nom_table"
SET "colonne1" = "valeur1", "colonne2" = "valeur2"
WHERE condition;

Exemples :
* Modifier le nom de la personne ayant l'identifiant 1
    * UPDATE new.enseignants SET nom="Michel" WHERE new.enseignants.enseignantID=1;

* Modifier le nom et le prenom de toutes personnes ayant la même valeur "ville"
    * UPDATE new.Enseignants SET nom='Michel', prenom="Michel" WHERE new.Enseignants.ville="Besancon";

Pour supprimer du contenu, on emploie la commande DELETE. Attention, si vous ne précisez pas la condition WHERE, tout le contenu de la table sera effacé : 

DELETE FROM table_name WHERE condition; 

Exemple :
* Supprimer toutes lignes dont le nom est "Michel"
    * DELETE FROM new.enseignants WHERE nom="Michel";

### Exercice

* Modifiez la valeur "nom" pour "Dupont" pour l'élément ayant l'identifiant 1
* Modifiez la valeur de "ville" pour "Saint-Claude" et "codePostal" pour "39000" pour l'élément ayant l'identifiant 3
* Supprimez tous les éléments dont le code postal est "25000"

### Solution

* UPDATE CentreTesniere.Enseignants SET nom="Dupont" WHERE CentreTesniere.Enseignants.idEnseignants=1;
* UPDATE CentreTesniere.Enseignants SET ville="Saint-Claude", codePostal=39000 WHERE CentreTesniere.Enseignants.idEnseignants=3;
* DELETE FROM CentreTesniere.Enseignants WHERE codePostal=25000;

## Intégration à partir d'un fichier et de l'interface

Souvent, on aura à intégrer des données existantes dans des fichiers tels que des fichiers CSV à des tables des bases de données.

* Dans la base, faire clique-droit sur l'onglet Tables, puis "Table Data Import Wizard"
* Sélectionner le fichier CSV que vous souhaitez intégrer
* Choissisez dans dans quel schéma intégrer cette table, ainsi que son nom
* Sélectionner le type de chaque colonne, ainsi que l'encodage de la table (prendre UTF-8)
* Lancer l'import
* Rafraîchir la base pour voir s'afficher la nouvelle table

### Exercice 

Intégrer le fichier etudiants.csv contenu dans le dossier "data"

## Relations entre tables
### Types de relations entre tables

Il existe trois types de relations entre tables :
* one-to-many
* many-to-many
* one-to-one

Les relations entre tables sont permises grâce aux clés primaires et clés étrangères qu'elles contiennent.

### Relation One-to-many

Cette relation existe entre une table et plusieurs autres. Par exemple, un enseignant peut enseigner à plusieurs classes, mais une classe ne peut être enseignée que par un seul enseignant; un responsable d'équipe peut gérer une ou plusieurs personnes, mais une personne ne peut être gérée que par un seul responsable. Ce type de relation nécessite au minimum deux tables pour être représenté.

**Table Enseignants**

<table><thead><tr><th>teacherId<br></th><th>LastName</th><th>FirstName</th></tr></thead><tbody><tr><td>1</td><td>Gutehrle</td><td>Nicolas</td></tr><tr><td>2</td><td>Ozturk</td><td>Yagmur</td></tr><tr><td>3</td><td>Nomblot</td><td>Aurelie<br></td></tr></tbody></table>

**Table Cours**
<table><thead><tr><th>classId</th><th>Name</th><th>teacherId</th></tr></thead><tbody><tr><td>1</td><td>GenieLogiciel<br></td><td>1</td></tr><tr><td>2</td><td>ModelisationPhonetique</td><td>3</td></tr><tr><td>3</td><td>LangueDeSpecialite</td><td>2</td></tr></tbody></table>

### Relations many-to-many

Ce type de relation nécessite trois tables : les deux tables que l'on souhaite associer, et une table dite de **jonction** servant à créer le lien. Par exemple, un client peut acheter plusieurs produits au marché, et un produit peut être acheté par plusieurs clients; un livre peut être écrit par plusieurs auteurs, et un autre peut écrire plusieurs livres. 

**Table Clients**
<table><thead><tr><th>customerId<br></th><th>LastName</th><th>FirstName</th></tr></thead><tbody><tr><td>1</td><td>Gutehrle</td><td>Nicolas</td></tr><tr><td>2</td><td>Ozturk</td><td>Yagmur</td></tr><tr><td>3</td><td>Nomblot</td><td>Aurelie<br></td></tr></tbody></table>

**Table Produits**
<table><thead><tr><th>productId<br></th><th>name</th></tr></thead><tbody><tr><td>1</td><td>steak</td></tr><tr><td>2</td><td>tofu</td></tr><tr><td>3</td><td>cafe</td></tr><tr><td>4</td><td>glace</td></tr></tbody></table>

**Table de jonction Clients-Produits**
<table><thead><tr><th>purchaseId<br></th><th>customerId</th><th>productId<br></th></tr></thead><tbody><tr><td>1</td><td>1</td><td>2</td></tr><tr><td>2</td><td>1</td><td>3</td></tr><tr><td>3</td><td>2</td><td>4</td></tr><tr><td>4</td><td>3</td><td>1</td></tr></tbody></table>

### Relations One-to-one

Ce type de relation existe entre deux tables, et connecte deux tables ayant des clés primaires identiques. Par exemple, un produit peut avoir des informations complémentaires contenues dans une autre table que la table Produit. Ce type de relation permet notamment d'éviter d'encombrer une table avec des informations peu ou rarement nécessaires.

**Table Produits**
<table><thead><tr><th>productId<br></th><th>name</th></tr></thead><tbody><tr><td>1</td><td>steak</td></tr><tr><td>2</td><td>tofu</td></tr><tr><td>3</td><td>cafe</td></tr><tr><td>4</td><td>glace</td></tr></tbody></table>

**Table ProduitsDetails**
<table><thead><tr><th>productId</th><th>bio</th><th>equitable<br></th><th>ogm</th></tr></thead><tbody><tr><td>1</td><td>True</td><td>False<br></td><td>False</td></tr><tr><td>2</td><td>False</td><td>False<br></td><td>True</td></tr><tr><td>3</td><td>True<br></td><td>True<br></td><td>False</td></tr><tr><td>4</td><td>True<br></td><td>False<br></td><td>False</td></tr></tbody></table>

### Exercice

* Créez une nouvelle base (schema) nommée CT. N'oubliez pas de sélectionner cette base après l'avoir créée.
* Chargez les données de chaque fichier dans cette base. Vous n'avez pas besoin de créer les tables en amont, MySQL Workbench se chargera de le faire en fonction du fichier CSV. S'il y a un problème pour intégrer les données, commencez par créer la table, puis y intégrer les données
* Une après l'autre, sélectionnez les données de chaque table

## Jointure

Pour créer les relations entre les tables, c'est-à-dire connecter les clés primaires et étrangères, on doit joindre les tables. Il existe quatre types de jointures :

* inner
* left
* right
* cross

La syntaxe pour chaque type de jointure est comme suit : 

SELECT (colonnes) FROM (schema.table)
(INNER|LEFT|RIGHT|CROSS) JOIN (schema.table2) ON (condition pour associer les tables)

Exemple : combiner deux tables par rapports aux clés primaires et étrangères

SELECT * FROM schema.table1 
INNER JOIN schema.table2
ON schema.table1.table1ID = schema.table2.table2ID

(Source des images : W3School)

### Inner join

Retourne les données présentes dans les deux tables (intersection). C'est le type de jointure le plus important et le plus fréquemment utilisé.

<img src="../../img/img_innerjoin.gif">

## Exercice

* Faites un INNER JOIN entre les tables Enseignants et Cours, en les joignant à partir de la colonne "enseignantID" (one-to-many)
* Faites un INNER JOIN entre les tables Enseignants et Infosenseignants, en les joignant à partir de la colonne "enseignantID" (one-to-one)

### Solution

*  SELECT * FROM CT.enseignants INNER JOIN CT.cours ON CT.enseignants.enseignantID = CT.cours.enseignantID

* SELECT * FROM CT.enseignants INNER JOIN CT.infosenseignants  ON CT.enseignants.enseignantID = CT.infosenseignants.enseignantID

### Left join

Retourne toutes les données de la table de gauche, ainsi que des données correspondantes dans la table de droite

<img src="../../img/img_leftjoin.gif">

### Exercice

* Faites un LEFT JOIN entre les tables Enseignants et Cours, en les joignant à partir de la colonne "enseignantID" (one-to-many)
* Faites un INNER JOIN entre les tables Enseignants et Infosenseignants, en les joignant à partir de la colonne "enseignantID" (one-to-one)

### Solution

*  SELECT * FROM CT.enseignants LEFT JOIN CT.cours  ON CT.enseignants.enseignantID = CT.cours.enseignantID
* SELECT * FROM CT.enseignants LEFT JOIN CT.infosenseignants  ON CT.enseignants.enseignantID = CT.infosenseignants.enseignantID

On remarque que par rapport à la sortie de INNER JOIN, il a plus de résultats, mais que certains ont des cellules vides, puisque certaines correspondances n'existent pas entre les deux tables.

### Right join

Inverse de left join, retourne toutes les données de la table de droite, ainsi que des données correspondantes dans la table de gauche

<img src="../../img/img_rightjoin.gif">

### Exercice

* Faites un RIGHT JOIN entre les tables Enseignants et Cours, en les joignant à partir de la colonne "enseignantID" (one-to-many)
* Faites un RIGHT JOIN entre les tables Enseignants et Infosenseignants, en les joignant à partir de la colonne "enseignantID" (one-to-one)

### Solution

* SELECT * FROM CT.enseignants RIGHT JOIN CT.cours  ON CT.enseignants.enseignantID = CT.cours.enseignantID

* SELECT * FROM CT.enseignants RIGHT JOIN CT.infosenseignants  ON CT.enseignants.enseignantID = CT.infosenseignants.enseignantID

On remarque que cette fois, il n'y a aucune cellule vide, puisqu'il y a des correspondances entre tous les éléments de la table droite avec la table gauche (ce qui n'était pas le cas dans le sens inverse)

### Crossjoin

Retourne toutes les données des deux tables

<img src="../../img/img_crossjoin.png">

### Exercices

* Faites un CROSS JOIN entre les tables Enseignants et Cours :
* Faites un CROSS JOIN entre les tables Enseignants et Infosenseignants :

### Solution

* SELECT * FROM CT.enseignants CROSS JOIN CT.cours

* SELECT * FROM CT.enseignants CROSS JOIN CT.infosenseignants

On remarque que toutes les données des deux tables sont retournées, qu'elles ne matchent ou pas

## Table de jonction

Pour joindre plus de deux tables (par exemple, dans un cas de relation many-to-many ), il faut employer plusieurs JOIN : un premier pour associer la table de gauche à la table de jonction, et un second pour joindre la table de jonction à la table de droite :

Exemple : 
* Voir les enseignants et les étudiants qui ont cours avec

SELECT * FROM CT.enseignants
INNER JOIN CT.EnseignantsEtudiants ON CT.enseignants.enseignantID = CT.EnseignantsEtudiants.enseignantID
INNER JOIN CT.etudiants ON CT.etudiants.etudiantID = CT.EnseignantsEtudiants.etudiantID

La jonction peut retourner beaucoup de colonnes. Pour limiter les résultats, il faut préciser les colonnes que l'on souhaite retourner. Ces colonnes peuvent être ambigues. Il faut donc préciser les tables :

Exemple : 
* Même requête que précédemment, mais on ne veut que les colonnes "nom" des tables "Enseignants" et "Etudiants" respectivement. Pour cela, il faut préciser les noms de tables avant les noms de colonnes

SELECT CT.enseignants.nom, CT.etudiants.nom FROM CT.enseignants
INNER JOIN CT.EnseignantsEtudiants ON CT.enseignants.enseignantID = CT.EnseignantsEtudiants.enseignantID
INNER JOIN CT.etudiants ON CT.etudiants.etudiantID = CT.EnseignantsEtudiants.etudiantID

---------

## Cas pratique

Créez une base "France", et utilisez là.

Ouvrez les fichiers "departement.sql" et "villes_france.sql" contenus dans le dossier data à l'aide de MySQL Workbench, puis exécuter leurs contenus. Votre base devrait désormais contenir deux nouvelles tables


Effectuez les requêtes suivantes :

* Obtenir la liste des 10 villes les plus peuplées en 2012

* Obtenir la liste des 50 villes ayant la plus faible superficie

* Obtenir la liste des départements d’outres-mer, c’est-à-dire ceux dont le numéro de département commencent par “97”

* Obtenir le nom des 10 villes les plus peuplées en 2012, ainsi que le nom du département associé

* Obtenir la liste du nom de chaque département, associé à son code et du nombre de commune au sein de ces département, en triant afin d’obtenir en priorité les départements qui possèdent le plus de communes

* Obtenir la liste des 10 plus grands départements, en terme de superficie

* Compter le nombre de villes dont le nom commence par “Saint”

* Obtenir la liste des villes qui ont un nom existants plusieurs fois, et trier afin d’obtenir en premier celles dont le nom est le plus souvent utilisé par plusieurs communes

* Obtenir en une seule requête SQL la liste des villes dont la superficie est supérieur à la superficie moyenne

* Obtenir la liste des départements qui possèdent plus de 2 millions d’habitants

* Remplacez les tirets par un espace vide, pour toutes les villes commençant par “SAINT-” (dans la colonne qui contient les noms en majuscule)

**Source des données, questions et réponses :** https://sql.sh/exercices-sql/villes-de-france

### Solution




SELECT * 
FROM `villes_france_free` 
ORDER BY `ville_population_2012` DESC 
LIMIT 10


SELECT * 
FROM `villes_france_free` 
ORDER BY `ville_surface` ASC 
LIMIT 50


SELECT * 
FROM `departement` 
WHERE `departement_code` LIKE '97%'


SELECT * 
FROM `villes_france_free` 
LEFT JOIN departement ON departement_code = ville_departement
ORDER BY `ville_population_2012` DESC 
LIMIT 10


SELECT departement_nom, ville_departement, COUNT(*) AS nbr_items 
FROM `villes_france_free` 
LEFT JOIN departement ON departement_code = ville_departement
GROUP BY ville_departement
ORDER BY `nbr_items` DESC


SELECT departement_nom, ville_departement, SUM(`ville_surface`) AS dpt_surface 
FROM `villes_france_free` 
LEFT JOIN departement ON departement_code = ville_departement
GROUP BY ville_departement  
ORDER BY dpt_surface  DESC
LIMIT 10


SELECT COUNT(*) 
FROM `villes_france_free` 
WHERE `ville_nom` LIKE 'saint%'


SELECT ville_nom, COUNT(*) AS nbt_item 
FROM `villes_france_free` 
GROUP BY `ville_nom` 
ORDER BY nbt_item DESC


SELECT * 
FROM `villes_france_free` 
WHERE `ville_surface` > (SELECT AVG(`ville_surface`) FROM `villes_france_free`)


SELECT ville_departement, SUM(`ville_population_2012`) AS population_2012
FROM `villes_france_free` 
GROUP BY `ville_departement`
HAVING population_2012 > 2000000
ORDER BY population_2012 DESC


UPDATE `villes_france_free` 
SET ville_nom = REPLACE(ville_nom, '-', ' ') 
WHERE `ville_nom` LIKE 'SAINT-%'